---
kind: method
id: M:Autodesk.Revit.DB.Analysis.AnalysisDisplayColorSettings.IsEqual(Autodesk.Revit.DB.Analysis.AnalysisDisplayColorSettings)
source: html/36fe8209-5a73-aad4-0626-27d0a04da158.htm
---
# Autodesk.Revit.DB.Analysis.AnalysisDisplayColorSettings.IsEqual Method

Compares two color settings objects.

## Syntax (C#)
```csharp
public bool IsEqual(
	AnalysisDisplayColorSettings other
)
```

## Parameters
- **other** (`Autodesk.Revit.DB.Analysis.AnalysisDisplayColorSettings`) - Color settings object to compare to.

## Returns
True if objects are equal, false otherwise.